<a href="https://colab.research.google.com/github/profliuhao/CSIT355/blob/main/CSIT_355_Module_5_SQL_aggregation_class_example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab 3: SQL Aggregation Queries

### [name]
### [student ID]

## Instruction
You need to finish all questions of In-class exercises. Name your ipynb file as StudentName_lab3.ipynb and download it as .py file. And then submit it on Canvas.

PLEASE ENSURE THAT THE SCRIPT CAN CORRECTLY EXECUTE!!!

In [1]:
#Let's connect to a database **lab3.db** using:
%load_ext sql
#%reload_ext sql
%sql sqlite:///lab3.db

# Product Schema Description

## Table: Product

| Field Name | Data Type | Description |
|------------|-----------|-------------|
| PName | VARCHAR(100) | Product Name |
| Price | DECIMAL(10, 2) | Product Price |
| Category | VARCHAR(50) | Product Category |
| Maker | VARCHAR(50) | Product Manufacturer |
| Year | INT | Manufacturing Year |

### Field Descriptions

#### PName (VARCHAR(100))
- Stands for "Product Name"
- Stores the name or model of the product
- **Example**: "Corolla", "F-150", "Model 3"

#### Price (DECIMAL(10, 2))
- Represents the price of the product
- Stored as a decimal number with up to 10 digits in total, including 2 decimal places
- **Example**: 20000.00, 45000.00

#### Category (VARCHAR(50))
- Indicates the category or type of the product
- Helps in classifying products into groups
- **Example**: "Sedan", "Truck", "Electric"

#### Maker (VARCHAR(50))
- Specifies the manufacturer or brand of the product
- Useful for grouping products by their makers
- **Example**: "Toyota", "Ford", "Tesla"

#### Year (INT)
- Represents the manufacturing year of the product
- Stored as an integer value
- **Example**: 2022, 2023

### Schema Usage

This schema allows for various queries and analyses, such as:

- Finding products by category, maker, or year
- Calculating average prices for specific makers or categories
- Identifying the newest or oldest products
- Determining the price range of products

### Design Considerations

1. **Data Types**:
   - VARCHAR for text fields allows flexibility in string length
   - DECIMAL for Price ensures precise storage of monetary values
   - INT for Year is sufficient for four-digit year values

2. **Normalization**:
   - This schema is in a denormalized form
   - Consider separating Maker into its own table for further normalization

3. **Indexing**:
   - Potential index candidates: Maker, Category, Year

4. **Constraints**:
   - Consider adding NOT NULL constraints where appropriate
   - Possible CHECK constraints:
     - Year <= CURRENT_YEAR
     - Price > 0

In [2]:
%%sql
-- Create the Product table
CREATE TABLE Product (
    PName VARCHAR(100),
    Price DECIMAL(10, 2),
    Category VARCHAR(50),
    Maker VARCHAR(50),
    Year INT
);

-- Insert sample data
INSERT INTO Product (PName, Price, Category, Maker, Year) VALUES
('Corolla', 20000.00, 'Sedan', 'Toyota', 2022),
('Camry', 25000.00, 'Sedan', 'Toyota', 2023),
('Civic', 22000.00, 'Sedan', 'Honda', 2022),
('F-150', 45000.00, 'Truck', 'Ford', 2023),
('Model 3', 40000.00, 'Electric', 'Tesla', 2023),
('Altima', 23000.00, 'Sedan', 'Nissan', 2022),
('Mustang', 35000.00, 'Sports Car', 'Ford', 1995),
('Prius', 28000.00, 'Hybrid', 'Toyota', 2023),
('Accord', 27000.00, 'Sedan', 'Honda', 2023),
('RAV4', 30000.00, 'SUV', 'Toyota', 2022);

 * sqlite:///lab3.db
Done.
10 rows affected.

[]

In [3]:
%%sql

-- Query 1: Count products after 1995
SELECT COUNT(*) FROM Product WHERE Year > 1995;

 * sqlite:///lab3.db
Done.

[(9,)]

In [4]:
%%sql
-- Query 2: Average price of Toyota products
SELECT AVG(Price) FROM Product WHERE Maker = 'Toyota';

 * sqlite:///lab3.db
Done.

[(25750.0,)]

In [5]:
%%sql

-- Query 3: Product(s) with the highest price
SELECT P.PName
FROM Product P
WHERE P.Price = (SELECT MAX(P2.Price) FROM Product P2);

 * sqlite:///lab3.db
Done.

[('F-150',)]

In [6]:
%%sql
-- Create the Purchase table
CREATE TABLE Purchase (
    Product VARCHAR(50),
    Date DATE,
    Price DECIMAL(10, 2),
    Quantity INT
);

-- Insert sample data
INSERT INTO Purchase (Product, Date, Price, Quantity) VALUES
('Bagel', '2005-10-21', 1.00, 20),
('Bagel', '2005-10-25', 1.50, 20),
('Banana', '2005-10-03', 0.50, 10),
('Banana', '2005-10-10', 1.00, 10),
('Apple', '2005-09-30', 0.75, 15),
('Apple', '2005-10-05', 0.80, 15),
('Orange', '2005-10-15', 0.60, 25),
('Orange', '2005-10-20', 0.70, 25);

 * sqlite:///lab3.db
Done.
8 rows affected.

[]

In [7]:
%%sql
-- The query to calculate total sales per product after 10/1/2005
SELECT
    Product,
    SUM(Price * Quantity) AS TotalSales
FROM
    Purchase
WHERE
    Date > '2005-10-01'
GROUP BY
    Product;

 * sqlite:///lab3.db
Done.

[('Apple', 12.0), ('Bagel', 50.0), ('Banana', 15.0), ('Orange', 32.5)]

In [11]:
%%sql
-- The query to calculate total sales per product after 10/1/2005 with more than 10 items
SELECT
    Product,
    SUM(Price * Quantity) AS TotalSales
FROM
    Purchase
WHERE
    Date > '2005-10-01'
GROUP BY
    Product
HAVING
  SUM(quantity) > 15;

 * sqlite:///lab3.db
Done.

[('Bagel', 50.0), ('Banana', 15.0), ('Orange', 32.5)]